.experiment-data/icl-stream-fio-read-cores2.fio0.txt
test: (g=0): rw=randread, bs=(R) 8192KiB-8192KiB, (W) 8192KiB-8192KiB, (T) 8192KiB-8192KiB, ioengine=libaio, iodepth=64
fio-3.28
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=35027: Tue Sep  8 18:13:20 2026
  read: IOPS=838, BW=6712MiB/s (7038MB/s)(918GiB/140076msec)
    slat (usec): min=165, max=18949, avg=197.19, stdev=200.88
    clat (msec): min=22, max=358, avg=75.99, stdev= 3.82
     lat (msec): min=22, max=361, avg=76.19, stdev= 3.91
    clat percentiles (msec):
     |  1.00th=[   75],  5.00th=[   75], 10.00th=[   75], 20.00th=[   77],
     | 30.00th=[   77], 40.00th=[   77], 50.00th=[   77], 60.00th=[   77],
     | 70.00th=[   77], 80.00th=[   77], 90.00th=[   77], 95.00th=[   78],
     | 99.00th=[   78], 99.50th=[   78], 99.90th=[   80], 99.95th=[  132],
     | 99.99th=[  292]
   bw (  MiB/s): min= 2864, max= 6768, per=100.00%, avg=6716.56, stdev=232.05, samples=279
   iops        : min=  358, max=  846, avg=839.57, stdev=29.01, samples=279
  lat (msec)   : 50=0.06%, 100=99.86%, 250=0.06%, 500=0.02%
  cpu          : usr=0.19%, sys=19.14%, ctx=120428, majf=0, minf=131082
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=117517,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=6712MiB/s (7038MB/s), 6712MiB/s-6712MiB/s (7038MB/s-7038MB/s), io=918GiB (986GB), run=140076-140076msec

Disk stats (read/write):
  nvme0n1: ios=821573/0, merge=0/0, ticks=61908170/0, in_queue=61908170, util=99.89%