.experiment-data/icl-stream-fio-read-cores2.fio3.txt
test: (g=0): rw=randread, bs=(R) 8192KiB-8192KiB, (W) 8192KiB-8192KiB, (T) 8192KiB-8192KiB, ioengine=libaio, iodepth=64
fio-3.28
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=35028: Tue Sep  8 18:13:20 2026
  read: IOPS=836, BW=6694MiB/s (7019MB/s)(916GiB/140084msec)
    slat (usec): min=165, max=18895, avg=194.58, stdev=193.47
    clat (msec): min=31, max=338, avg=76.20, stdev= 3.69
     lat (msec): min=31, max=340, avg=76.39, stdev= 3.77
    clat percentiles (msec):
     |  1.00th=[   75],  5.00th=[   77], 10.00th=[   77], 20.00th=[   77],
     | 30.00th=[   77], 40.00th=[   77], 50.00th=[   77], 60.00th=[   77],
     | 70.00th=[   77], 80.00th=[   77], 90.00th=[   78], 95.00th=[   78],
     | 99.00th=[   78], 99.50th=[   78], 99.90th=[   79], 99.95th=[  140],
     | 99.99th=[  288]
   bw (  MiB/s): min= 3152, max= 6752, per=100.00%, avg=6699.30, stdev=213.60, samples=279
   iops        : min=  394, max=  844, avg=837.41, stdev=26.70, samples=279
  lat (msec)   : 50=0.06%, 100=99.86%, 250=0.07%, 500=0.02%
  cpu          : usr=0.20%, sys=19.20%, ctx=118619, majf=0, minf=131082
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=117219,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=6694MiB/s (7019MB/s), 6694MiB/s-6694MiB/s (7019MB/s-7019MB/s), io=916GiB (983GB), run=140084-140084msec

Disk stats (read/write):
  nvme3n1: ios=819448/0, merge=0/0, ticks=61919848/0, in_queue=61919848, util=99.89%