.experiment-data/icl-stream-fio-read-cores8.fio2.txt
test: (g=0): rw=randread, bs=(R) 8192KiB-8192KiB, (W) 8192KiB-8192KiB, (T) 8192KiB-8192KiB, ioengine=libaio, iodepth=64
fio-3.28
Starting 1 process

test: (groupid=0, jobs=1): err= 0: pid=36754: Tue Sep  8 18:18:02 2026
  read: IOPS=836, BW=6692MiB/s (7017MB/s)(915GiB/140076msec)
    slat (usec): min=176, max=3158, avg=190.86, stdev=68.26
    clat (msec): min=18, max=195, avg=76.26, stdev= 2.05
     lat (msec): min=18, max=198, avg=76.45, stdev= 2.07
    clat percentiles (msec):
     |  1.00th=[   75],  5.00th=[   77], 10.00th=[   77], 20.00th=[   77],
     | 30.00th=[   77], 40.00th=[   77], 50.00th=[   77], 60.00th=[   77],
     | 70.00th=[   77], 80.00th=[   77], 90.00th=[   78], 95.00th=[   78],
     | 99.00th=[   78], 99.50th=[   78], 99.90th=[   79], 99.95th=[  116],
     | 99.99th=[  165]
   bw (  MiB/s): min= 5040, max= 6736, per=100.00%, avg=6697.52, stdev=100.35, samples=279
   iops        : min=  630, max=  842, avg=837.19, stdev=12.54, samples=279
  lat (msec)   : 20=0.02%, 50=0.04%, 100=99.88%, 250=0.06%
  cpu          : usr=0.18%, sys=20.83%, ctx=117129, majf=0, minf=131082
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=117177,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=6692MiB/s (7017MB/s), 6692MiB/s-6692MiB/s (7017MB/s-7017MB/s), io=915GiB (983GB), run=140076-140076msec

Disk stats (read/write):
  nvme2n1: ios=819175/0, merge=0/0, ticks=62005736/0, in_queue=62005736, util=100.00%